from ThavaXMusic import app 
import asyncio
import random
from pyrogram import Client, filters
from pyrogram.enums import ChatType, ChatMemberStatus
from pyrogram.errors import UserNotParticipant
from pyrogram.types import ChatPermissions

spam_chats = []

EMOJI = [ "🦋🦋🦋🦋🦋",
          "🧚🌸🧋🍬🫖",
          "🥀🌷🌹🌺💐",
          "🌸🌿💮🌱🌵",
          "❤️💚💙💜🖤",
          "💓💕💞💗💖",
          "🌸💐🌺🌹🦋",
          "🍔🦪🍛🍲🥗",
          "🍎🍓🍒🍑🌶️",
          "🧋🥤🧋🥛🍷",
          "🍬🍭🧁🎂🍡",
          "🍨🧉🍺☕🍻",
          "🥪🥧🍦🍥🍚",
          "🫖☕🍹🍷🥛",
          "☕🧃🍩🍦🍙",
          "🍁🌾💮🍂🌿",
          "🌨️🌥️⛈️🌩️🌧️",
          "🌷🏵️🌸🌺💐",
          "💮🌼🌻🍀🍁",
          "🧟🦸🦹🧙👸",
          "🧅🍠🥕🌽🥦",
          "🐷🐹🐭🐨🐻‍❄️",
          "🦋🐇🐀🐈🐈‍⬛",
          "🌼🌳🌲🌴🌵",
          "🥩🍋🍐🍈🍇",
          "🍴🍽️🔪🍶🥃",
          "🕌🏰🏩⛩️🏩",
          "🎉🎊🎈🎂🎀",
          "🪴🌵🌴🌳🌲",
          "🎄🎋🎍🎑🎎",
          "🦅🦜🕊️🦤🦢",
          "🦤🦩🦚🦃🦆",
          "🐬🦭🦈🐋🐳",
          "🐔🐟🐠🐡🦐",
          "🦩🦀🦑🐙🦪",
          "🐦🦂🕷️🕸️🐚",
          "🥪🍰🥧🍨🍨",
          " 🥬🍉🧁🧇",
        ]

TAGMES = [ " **எவ்வளோ பேர் இருக்கிறாங்குறத்து முக்கியம் இல்லை! , இருக்கான்றதுதான் முக்கியம்!😏.** ",
           " **IPL லில் அதிக கோப்பையை வென்ற ஒரு தனி நபர் யார்?🏆.** ",
           " **கனவே கனவே கலைவதேனோ கணங்கள் ரணமாய் கரைவதேனோ நினைவே நினைவே அரைவதேனோ எனது உலகம் உடைவதேனோ💔** ",
           " **சென்று வாருங்கள்🥰** ",
           " **நீங்கள் திரும்ப வந்தால் மீண்டும் வரவேற்க காத்திருப்பேன்🥳** ",
           " **மௌனமான மரணம் ஒன்று உயிரை கொண்டு போனதே உயரமான கனவு இன்று தரையில் வீழ்ந்து போனதே💔** ",
           " **நீங்கள் பார்த்த பிரச்சனைகள் யாருக்கும் தெரியாது** ",
           " **நீ மங்குனி அமைச்சர் என்பதை மணிக்கு ஒருமுறை நிரூபித்துக் கொண்டே இருக்கிறாய்! 😂** ",
           " **பன்னிக்குட்டி எல்லாம் பஞ்சு டயலாக் பேசுதடா🤯** ",
           " **டேய் எனக்கு வெறி வர்றதுக்குள்ள இங்கிருந்து போய்டுடா😡** ",
           " **அறிவு கெட்ட நாதாரி😤** ",
           " **மூடிட்டு போடா வெண்ண! 😂** ",
           " **பிசாசுக்கு பொறந்த பிசாசே👻** ",
           " **பொண்ண பெக்க சொன்னா பொறுக்கிய பெத்துவிட்டுருக்காய்ங்க!😂😒** ",
           " **இஞ்சி தின்ன கொரங்கு மாறி இருக்க 🐵** ",
           " **நல்லவர்களை நம்புங்கள்** ",
           " **டேய் டேய் மூஞ்சியும் மொகரையும் பாரு🤯** ",
           " **என்ன Look-உ அப்படியே கண்ண புடுங்கி தின்னுபுடுவேன் மொகரைய பாரு மொகரைய என்ன என்னாடா என்னா😏.** ",
           " **ரத்தம் கக்கி சாவு 🙊** ",
           " **டேய் எனக்கு வெறி வர்றதுக்குள்ள இங்கிருந்து போய்டுடா😡** ",
           " **போடா 🦊 நரி** ",
           " **மூடிட்டு போடா வெண்ண! 😂** ",
           " **வாய்ப்பில்ல ராஜா.** ",
           " **டேய் இந்த எகத்தாலமெல்லாம் என்கிட்டே வெச்சிக்காதா** ",
           " **என்னப்பா உனக்கு பிரச்சன? 😣** ",
           " **ஏன்டா அறிவுகெட்டவனே அறிவு இருக்கா உனக்கு மடப்பயலே முட்டா பயலே சோத்தை திங்கிறியா இல்ல சோத்தை விட்டுட்டு லட்டியை திங்கிறியா டா😂😂🤣🤣** ",
           " **ஏண்டா நாயா அடிக்கிற நாயே🐶** ",
           " **அடப்பாவி சண்டாளா நீயா டா என்னை கலாய்க்க வந்த🤧** ",
           " **இது எல்லாம் ஒரு பொழப்பு 🥵 போய் பிச்சை எடு போ** ",
           " **𝐇𝐞𝐥𝐥𝐨🙊** ",
           " **டேய் நீ நல்லா இருக்க மாட்டடா நல்லாவே இருக்க மாட்டடா நாசமா போனவன்😑🤧** ",
           " **ஏண்டா நாயா அடிக்கிற நாயே🐶** ",
           " **மனசார சொல்றேன் டா சாத்தியமா நீ எல்லாம் உருப்பட மாட்ட உருப்படவே மாட்ட🤦‍♀** ",
           " **நீ பெரிய முட்டாள்னு எனக்கு எப்பயோ தெரியும்! 😜** ",
           " **மூடிட்டு போடா வெண்ண! 😂.** ",
           " **யார் எடத்துல வந்து  யார் Scene-அ போடுறது  செஞ்சுருவேன்😤😡.** ",
           " **ஆணியே புடுங்க வேணாம்🙄.** ",
           " **என்னப்பா உனக்கு பிரச்சன? 😣** ",
           " **அடிவாங்குறதுக்குனே அளவெடுத்து செஞ்சமாதிரி இருக்கான்👊** ",
           " **Please don't leave me alone in this place😹** ",
           " **அடேய் பொறம்போக்கு வீட்ல சொல்லிட்டு வந்தியா ?.** ",
           " **ஜிஞ்சர் ஈட்டிங்க் மங்க்கி 🐵** ",
           " **ஏன்டா அறிவுகெட்டவனே அறிவு இருக்கா உனக்கு மடப்பயலே முட்டா பயலே சோத்தை திங்கிறியா இல்ல சோத்தை விட்டுட்டு லட்டியை திங்கிறியா டா😂😂🤣🤣.** ",
           " **அய்யயோ! இந்த ஆளு Teacher-அ வச்சுருக்கான்டோ அதை நான் பாத்து போட்டேன்டோ😆** ",
           " **போட எச்ச பயலே 🥶💦.** ",
           " **மனசார சொல்றேன் டா சாத்தியமா நீ எல்லாம் உருப்பட மாட்ட உருப்படவே மாட்ட🤦‍♀** ",
           " **பேச தெரிஞ்சா பேசு தேவையில்லாம பேசி அடிவாங்கி சாகதா 🤬.** ",
           " **மறந்தாயே மறந்தாயே பெண்ணே என்னை ஏன் மறந்தாய் கடந்தேதான் நடந்தாயே யாரோ என்று ஏன் கடந்தாய்!🥺💔.** ",
           " **தனியாக தவிக்கின்றேன் துணைவேண்டாம் அன்பே போ🥺.** ",
           " **ஏன் என்னை பிரிந்தாய் என் உயிரே என் உயிரே🥺💔.** ",
           " **🎼இளமை திரும்புதே புரியாத புதிராச்சே இதய துடிப்பிலே பனி காத்தும் சூடாச்சே🎼** ",
           " **குருநாதா! இதுக்கு மேல தாங்க முடியாது குருநாதா... 🥶🤬.** ",
           " **வந்திருக்கிறது சாதாரண ஆள் இல்ல பயத்துக்கே பயம் காட்டுரவன் 😎** ",
           " **எங்களுக்கு ஒரு கதை சொல்லிட்டு அப்பறம் பேசுங்க! 😍** ",
           " **அடிவெள்ளாவிவச்சுத் தான் வெளுத்தாய்ங்களா உன்ன வெயிலுக்கு காட்டாம வளர்த்தாய்ங்களா!🙈🥳😍.** ",
           " **Chatting Start பண்ண மாட்டான்.பண்ணிட்டான் நிறுத்த மாட்டான்🤪** "
           " **𝐇𝐢𝐢👀** ",
           " **நம்ம ஊருக்கு நாய் புடிக்குற வண்டி வரட்டும் கண்டிப்பா, உன்னை நான் புடிச்சு குடுத்துறேன்!😂** ",
           " **எல்லாரும் பணம் இருந்தா நிம்மதியா வாழ்ந்திரலாம்னு நெனைக்குறாங்க ஆனா பணம் இல்லேன்னா நிம்மதியான சாகக்கூட முடியாதுனு யாரும் நெனைக்குறதே இல்லை!🎈** ",
           " **🎺 தங்கமே உன்னத்தான் தேடிவந்தேன் நானே வைரமே ஒருநாள் உன்னத் தூக்குவேனே..! 🎺** ",
           " **வாங்க {first} வந்து மொக்க அறுவையை போடுங்க!😂** ",
           " **கலப்படமான நல்லவனா இருக்குறதுக்கு சுத்தமான கெட்டவனா  இருந்துட்டு போகலாம்😍** ",
           " **யாருமே இல்லாத Group-ல யாருக்குடா Message பண்ற உன் கடமை உணர்ச்சிக்கு ஒரு அளவே இல்லையாடா🤦‍♀😂** ",
           " **வாங்க {first} எல்லாரும் Busy நான் உங்களை வரவேற்கிறேன்🙏** ",
           " **Long-ல பார்த்தத்தான்டா Comedy-யா இருப்பேன் கிட்டத்துல பார்த்த Terror-ஆ இருப்பேன்டா Terror-ஆ😤** ",
           " **உங்களுக்கு Comedy பண்ண தெரியுமா? 😇** ",
           " **சம்பவம் செய்யும் வேலைய எல்லாம் அஞ்சாறு வாரம் ஒத்தி போடு Groupக்கு யாரும் வந்தாலும்கூட வள்ளலார் போல வணக்கம் போடு!😂🙏** ",
           " **உங்களை யார் (inspires)தூண்டுகிறார்கள்? நீங்கள் யாரைப் போல இருக்க விரும்புகிறீர்கள்? 🎈** ",
           " **உலக கோப்பை கிரிக்கெட் விளையாட்டில் அதிக முறை கோப்பையை வென்ற அணி எது?🏆** ",
           " **சம்பவம் செய்யும் வேலைய எல்லாம் அஞ்சாறு வாரம் ஒத்தி போடு Groupக்கு யாரும் வந்தாலும்கூட வள்ளலார் போல வணக்கம் போடு!😂🙏** ",
           " **நீங்கள் அதிக முறை திரைப்படம் எது👀** ",
           " **உங்கள் ராசி என்ன?👀.** ",
           " **உனக்கு welcome ல பண்ண முடியாது 😏** ",
           " **ஒரு பூ மலர பல பருவங்களை கடக்கிறது நீ உன் வாழ்க்கையை உணர பல தடைகளை கடந்து  செல்** ",
           " **என்னவளே என் மனதில் உள்ள எனது எண்ணத்தை நீ அறிந்தும் அறியாதது போல நடிக்கிறாயா இல்லை தகுந்த சந்தர்ப்பம் அமையட்டும் என எதிர்பார்த்து காத்திருக்கிறாயா பெண்ணே🥳🥰** ",
           " **😈 இது கலவர பூமி ⚔️🗡🔪 ! இங்கு ஏன் வந்தீங்க?😳** ",
           " **நல்லா குற்றாலத்துல இருக்கவேண்டியவன்லாம் இங்க வந்து நம்ம உயிர வாங்குறாங்கே!😒** ",
           " **என்ன ஞாபகம் இருக்கா மச்சான்** ",
           " **நான் உன்ன விரும்பல... உன் மேல ஆசப்படல... நீ அழகா இருக்கேனு நினைக்கல... ஆனா இதெல்லாம் நடந்துடுமோனு பயமா இருக்கு🙈🙈** ",
           " **❤️ உங்களுக்காக தான் எல்லாரும் காத்துகிட்டு இருந்தோம்! Welcome 🥳** ",
           " **நீங்கள் Join பண்ணா மட்டும் போதாது உங்கள் Friends-யும் Invite பண்ணுங்க!😐** ",
           " **தனிமை கொடுமையானது! 🥺 அதனால், எங்களோடு சேர்ந்து கொள்ளுங்கள்!☺️.** ",
           " **தனிமை கொடுமையானது! 🥺 அதனால், எங்களோடு சேர்ந்து கொள்ளுங்கள்!☺️** ",
           " **நீங்க வேணா Group-ல Clash-அ Boss-அ சுத்தலாம் ஆனா,  Mass என்னனு தெரியாதுல!😎.** ",
           " **நீங்க இங்க இருக்கீங்க! உங்க Friends-லாம் எங்க? 🤨** ",
           " **Chat முக்கியம் பிகிலு..!🔥** ",
           " **ஒரு குழந்தை உருவாக்குறத்துக்கு பத்து மாசம்! ஒரு பட்டதாரி உருவாக்குறத்துக்கு மூனு வருஷம்! ஆனா ஒரு Best Admin உருவாக்குறதுக்கு ஒரு யுகமே தேவைபடுது** ",
           " **நீங்க Join பண்ணத நாங்க பார்த்துட்டோம்!🙈🙊** ",
           ]

@app.on_message(filters.command(["tagall", "spam", "tagmember", "utag", "stag", "hftag", "bstag", "eftag", "tag", "etag", "utag", "atag"], prefixes=["/", "@", "#"]))
async def mentionall(client, message):
    chat_id = message.chat.id
    if message.chat.type == ChatType.PRIVATE:
        return await message.reply("𝐓𝐡𝐢𝐬 𝐂𝐨𝐦𝐦𝐚𝐧𝐝 𝐎𝐧𝐥𝐲 𝐅𝐨𝐫 𝐆𝐫𝐨𝐮𝐩𝐬.")

    is_admin = False
    try:
        participant = await client.get_chat_member(chat_id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("𝐘𝐨𝐮 𝐀𝐫𝐞 𝐍𝐨𝐭 𝐀𝐝𝐦𝐢𝐧 𝐁𝐚𝐛𝐲, 𝐎𝐧𝐥𝐲 𝐀𝐝𝐦𝐢𝐧𝐬 𝐂𝐚𝐧 . ")

    if message.reply_to_message and message.text:
        return await message.reply("/tagall  𝐓𝐲𝐩𝐞 𝐋𝐢𝐤𝐞 𝐓𝐡𝐢𝐬 / 𝐑𝐞𝐩𝐥𝐲 𝐀𝐧𝐲 𝐌𝐞𝐬𝐬𝐚𝐠𝐞 𝐍𝐞𝐱𝐭 𝐓𝐢𝐦𝐞 ")
    elif message.text:
        mode = "text_on_cmd"
        msg = message.text
    elif message.reply_to_message:
        mode = "text_on_reply"
        msg = message.reply_to_message
        if not msg:
            return await message.reply("/tagall  𝐓𝐲𝐩𝐞 𝐋𝐢𝐤𝐞 𝐓𝐡𝐢𝐬 / 𝐑𝐞𝐩𝐥𝐲 𝐀𝐧𝐲 𝐌𝐞𝐬𝐬𝐚𝐠𝐞 𝐍𝐞𝐱𝐭 𝐓𝐢𝐦𝐞 ...")
    else:
        return await message.reply("/tagall  𝐓𝐲𝐩𝐞 𝐋𝐢𝐤𝐞 𝐓𝐡𝐢𝐬 / 𝐑𝐞𝐩𝐥𝐲 𝐀𝐧𝐲 𝐌𝐞𝐬𝐬𝐚𝐠𝐞 𝐍𝐞𝐱𝐭 𝐓𝐢𝐦𝐞 ..")
    if chat_id in spam_chats:
        return await message.reply("𝐏𝐥𝐞𝐚𝐬𝐞 𝐀𝐭 𝐅𝐢𝐫𝐬𝐭 𝐒𝐭𝐨𝐩 𝐑𝐮𝐧𝐧𝐢𝐧𝐠 𝐏𝐫𝐨𝐜𝐞𝐬𝐬 ...")
    spam_chats.append(chat_id)
    usrnum = 0
    usrtxt = ""
    async for usr in client.get_chat_members(chat_id):
        if not chat_id in spam_chats:
            break
        if usr.user.is_bot:
            continue
        usrnum += 1
        usrtxt += f"[{usr.user.first_name}](tg://user?id={usr.user.id}) "

        if usrnum == 1:
            if mode == "text_on_cmd":
                txt = f"{usrtxt} {random.choice(TAGMES)}"
                await client.send_message(chat_id, txt)
            elif mode == "text_on_reply":
                await msg.reply(f"[{random.choice(EMOJI)}](tg://user?id={usr.user.id})")
            await asyncio.sleep(4)
            usrnum = 0
            usrtxt = ""
    try:
        spam_chats.remove(chat_id)
    except:
        pass

@app.on_message(filters.command(["tagoff", "tagstop"]))
async def cancel_spam(client, message):
    if not message.chat.id in spam_chats:
        return await message.reply("𝐂𝐮𝐫𝐫𝐞𝐧𝐭𝐥𝐲 𝐈'𝐦 𝐍𝐨𝐭 ..")
    is_admin = False
    try:
        participant = await client.get_chat_member(message.chat.id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("𝐘𝐨𝐮 𝐀𝐫𝐞 𝐍𝐨𝐭 𝐀𝐝𝐦𝐢𝐧 𝐁𝐚𝐛𝐲, 𝐎𝐧𝐥𝐲 𝐀𝐝𝐦𝐢𝐧𝐬 𝐂𝐚𝐧 𝐓𝐚𝐠 𝐌𝐞𝐦𝐛𝐞𝐫𝐬.")
    else:
        try:
            spam_chats.remove(message.chat.id)
        except:
            pass
        return await message.reply("♦STOP♦")
